Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВДолларах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоВДолларах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвансВДолларах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвансВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыдачеВДолларах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыдачеВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкладВДолларах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкладВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПремияВДолларах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПремияВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрафВДолларах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрафВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеВыдано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидДвиженияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логистика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичнаяИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
					<Comment>Склады, на к-рых сотрудник работает оператором</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПометкиИнвертировать(Команда)
	ПометкиОбработать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСнять(Команда)
	ПометкиОбработать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиУстановить(Команда)
	ПометкиОбработать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиОбработать(Пометка)

	Для каждого Эл Из Этаформа.ФильтрОфис Цикл
		Если Пометка = Неопределено Тогда
			Эл.Пометка = НЕ Эл.Пометка;
		Иначе
		    Эл.Пометка = Пометка;
		КонецЕсли;
	КонецЦикла;	
    ФильтрОфисПометкаПриИзменении(Неопределено);
	 
КонецПроцедуры


#Область ДействияФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;

	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

	ВалютаРубль = омСервер.ПолучитьВалюту("руб");
	ВалютаДоллар = омСервер.ПолучитьВалюту("USD");  
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта = ВалютаДоллар;
	КонецЕсли; 
	
	Для каждого СтрокаТЧ Из Объект.Список Цикл
		СтрокаТЧ.Офис = СтрокаТЧ.Сотрудник.Офис;
	КонецЦикла;
	ОбновитьФильтр();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	Месяц = Формат(Объект.Период, "ДФ='MMMM yyyy'");
	Если Год(Объект.Период) = 1 Тогда
		СформироватьСписокВыбораМесяца(Год(ТекущаяДата()));
	Иначе
		СформироватьСписокВыбораМесяца(Год(Объект.Период));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СуммаВДолларах = Объект.Список.Итог("КВыдачеВДолларах");
	Объект.СуммаВРублях = Объект.Список.Итог("КВыдачеВРублях");

КонецПроцедуры

#КонецОбласти 


#Область ДействияЭлементовШапки

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	Если Месяц <> "" Тогда
		Если СтрДлина(Месяц)=4 Тогда 
			СформироватьСписокВыбораМесяца(Число(Месяц));
			Объект.Период = НачалоМесяца(Дата(Число(Месяц), 1, 1));
			Месяц = Формат(Объект.Период, "ДФ='MMMM yyyy'");
		Иначе
			НомМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(Месяц,3)))+2)/3; //получаем номер месяца
			ВыбрГод = Число(Прав(Месяц, 4));
			Объект.Период = НачалоМесяца(Дата(ВыбрГод, НомМесяца, 1));
		КонецЕсли;    
	КонецЕсли;
	
	Объект.Список.Очистить();
    Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
 Процедура КурсПриИзменении(Элемент)	
	ОчиститьКВыдаче();	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОчиститьКВыдаче();
    Модифицированность = Истина;

КонецПроцедуры


#КонецОбласти 


#Область ДействияЭлементовТЧ

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ПересчитатьСтрокуТЧ(Элемент.ТекущиеДанные);  
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 И Объект.Список.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Очистить табличную часть документа 'Начисление зарплаты'?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Список.Очистить();
		КонецЕсли;
	КонецЕсли; 
	Для каждого Подбор Из ВыбранноеЗначение Цикл
		Строка = Объект.Список.Добавить();
		Строка.Сотрудник = Подбор.ФИО;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокНачисленоВДолларахПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущиеДанные.НачисленоВРублях = 0;
	ТекущиеДанные.КВыдачеВРублях = 0;
	ТекущиеДанные.КВыдачеВДолларах = ?(Объект.Курс <> 0,ТекущиеДанные.НачисленоВДолларах - ТекущиеДанные.АвансВДолларах - ТекущиеДанные.АвансВРублях/Объект.Курс,0)  ;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНачисленоВРубляхПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущиеДанные.НачисленоВДолларах = 0;
	ТекущиеДанные.КВыдачеВДолларах = 0;
	ТекущиеДанные.КВыдачеВРублях = (ТекущиеДанные.НачисленоВРублях - ТекущиеДанные.АвансВРублях - ТекущиеДанные.АвансВДолларах*Объект.Курс)  ;

КонецПроцедуры

#КонецОбласти 


#Область Команды


&НаКлиенте
Процедура Установить(Команда)

	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Список.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект),
		НСтр("ru = 'Установить флаг <Окончательно>? 
							|Документ будет проведен.'; en = 'Set flag <Finaly>?'"));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Попытка
		Объект.Окончательно = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));             
		УстановитьДоступность();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
//	гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);	

КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	//// © Primus1C  06.02.2024  НАЧАЛО ►
	//Если ОбщегоНазначенияПовтИсп.ДоступБухгалтерии() Тогда
	//	Если клНетДа(НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'")) Тогда Возврат КонецЕсли;
	//	Объект.Окончательно = Ложь;
	//	МояЗаписать(Ложь);    
	//	МоиИтоги();
	//	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);    
	//	Возврат;
	//КонецЕсли;
	//// © Primus1C  ОКОНЧАНИЕ ◄

	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	//
	//Сч = 0;
	//Для Каждого Стр Из Объект.Товары Цикл
	//	Нельзя = ?(НельзяРедактироватьЦену(Стр.Партия), 1, 0);
	//	Сч = Сч + Нельзя;
	//	Если Нельзя = 0 Тогда Продолжить КонецЕсли;
	//	Сообщить(НСтр("ru = 'Есть движения партии: '; en = 'Batches movements are posted: '") + гоИмя(Стр.Партия));
	//КонецЦикла;
	//
	////Если НЕ гоЕстьРоль("Оператор") Тогда
	//	Если Сч <> 0 Тогда клОшибка(НСтр("ru = 'Есть движения партий '; en = 'Batches movements are posted '") + гоИмя(Сч) + "!"); Возврат; КонецЕсли;
	////КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект),
		НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'"));

КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	//МояЗаписать(Ложь);
	Записать();
	УстановитьДоступность();

	//гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);

КонецПроцедуры



&НаКлиенте
Процедура Подбор(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
	ОткрытьФорму("Документ.НачислениеЗарплаты.Форма.ФормаВыбора",ПараметрыФормы,Элементы.Список,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	ЗаполнитьАвансыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	// © Primus1C  23.08.2025  НАЧАЛО ► 
	АвансыРубль = Новый Соответствие;
	АвансыДоллар = Новый Соответствие;
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЗарплатаОбороты.Валюта = &Доллар
	             |			ТОГДА ЗарплатаОбороты.ОстатокРасход
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК АвансВДолларах,
	             |	ВЫБОР
	             |		КОГДА ЗарплатаОбороты.Валюта = &Рубль
	             |			ТОГДА ЗарплатаОбороты.ОстатокРасход
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК АвансВРублях,
	             |	ЗарплатаОбороты.Сотрудник КАК Сотрудник
	             |ИЗ
	             |	РегистрНакопления.Зарплата.Обороты(, , , МесяцЗП = &МесяцЗП) КАК ЗарплатаОбороты";
	Запр.УстановитьПараметр("Рубль", 	ВалютаРубль);
	Запр.УстановитьПараметр("Доллар", 	ВалютаДоллар);
	Запр.УстановитьПараметр("МесяцЗП", 	НачалоМесяца(Объект.Период));
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АвансыРубль.Вставить(Выборка.Сотрудник, Выборка.АвансВРублях);			
		АвансыДоллар.Вставить(Выборка.Сотрудник, Выборка.АвансВДолларах);			
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.Список Цикл
		СтрокаТЧ.АвансВРублях 		= АвансыРубль.Получить(СтрокаТЧ.Сотрудник);	
		СтрокаТЧ.АвансВДолларах 	= АвансыДоллар.Получить(СтрокаТЧ.Сотрудник);	
		СтрокаТЧ.КВыдачеВРублях 	= СтрокаТЧ.НачисленоВРублях - СтрокаТЧ.АвансВРублях - СтрокаТЧ.ШтрафВРублях;
		СтрокаТЧ.КВыдачеВДолларах 	= СтрокаТЧ.НачисленоВДолларах - СтрокаТЧ.АвансВДолларах - СтрокаТЧ.ШтрафВДолларах;
	КонецЦикла;
	
	Возврат;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Если Не Объект.Курс = 0 Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗ.Сотрудник
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвижениеДенег.Валюта,
		|	СУММА(ДвижениеДенег.Сумма) КАК Сумма,
		|	ДвижениеДенег.Сотрудник
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	Документ.ДвижениеДенег КАК ДвижениеДенег
		|ГДЕ
		|	ДвижениеДенег.Проведен
		|	И НЕ ДвижениеДенег.ПометкаУдаления
		|	И ДвижениеДенег.ВидДвиженияДенег = &ВидДвиженияДенег
		|	И ДвижениеДенег.МесяцЗП МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвижениеДенег.Сотрудник,
		|	ДвижениеДенег.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сотрудники.Сотрудник,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Валюта = &Рубль
		|			ТОГДА ВТ_Документы.Сумма
		|	КОНЕЦ КАК АвансВРублях,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.Валюта = &Доллар
		|			ТОГДА ВТ_Документы.Сумма
		|	КОНЕЦ КАК АвансВДолларах
		|ИЗ
		|	ВТ_Сотрудники КАК ВТ_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
		|		ПО ВТ_Сотрудники.Сотрудник = ВТ_Документы.Сотрудник";
		
		Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Объект.Период));
		Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.Период));
		Запрос.УстановитьПараметр("ВидДвиженияДенег", ПредопределенноеЗначение("Перечисление.ВидДвиженияДенег.Зарплата"));
		Запрос.УстановитьПараметр("ТЗ", 			Объект.Список.Выгрузить());
		Запрос.УстановитьПараметр("Доллар", 		ВалютаДоллар);
		Запрос.УстановитьПараметр("Рубль", 			ВалютаРубль);
		ТаблицаАвансов = Запрос.Выполнить().Выгрузить();
		ТаблицаАвансов.Свернуть("Сотрудник","АвансВДолларах,АвансВРублях");
		
		Объект.Список.Загрузить(ТаблицаАвансов);
		Модифицированность = Истина;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен курс валюты!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Сотрудники.Ссылка КАК Сотрудник,
	             |	Сотрудники.Офис КАК Офис,
	             |	ВЫБОР
	             |		КОГДА Сотрудники.Валюта = &Доллар
	             |			ТОГДА Сотрудники.Оклад
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК ОкладВДолларах,
	             |	ВЫБОР
	             |		КОГДА Сотрудники.Валюта = &Рубль
	             |			ТОГДА Сотрудники.Оклад
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК ОкладВРублях,
	             |	ВЫБОР
	             |		КОГДА Сотрудники.Валюта = &Доллар
	             |			ТОГДА Сотрудники.Оклад
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК НачисленоВДолларах,
	             |	ВЫБОР
	             |		КОГДА Сотрудники.Валюта = &Рубль
	             |			ТОГДА Сотрудники.Оклад
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК НачисленоВРублях,
	             |	Сотрудники.Валюта КАК Валюта
	             |ИЗ
	             |	Справочник.Сотрудники КАК Сотрудники
	             |ГДЕ
	             |	НЕ Сотрудники.ПометкаУдаления
	             |	И Сотрудники.ПринятНаРаботу <> &БезДаты
	             |	И Сотрудники.ПринятНаРаботу <= &ДатаПринят
	             |	И (Сотрудники.ДатаУвольнения = &БезДаты
	             |			ИЛИ Сотрудники.ДатаУвольнения >= &ДатаУволен)";
	Запр.УстановитьПараметр("БезДаты", Дата(1,1,1));
	Запр.УстановитьПараметр("Рубль", ВалютаРубль);
	Запр.УстановитьПараметр("Доллар", ВалютаДоллар);
	Запр.УстановитьПараметр("ДатаПринят", КонецМесяца(Объект.Период));
	Запр.УстановитьПараметр("ДатаУволен", НачалоМесяца(Объект.Период));  
	Выгрузка = Запр.Выполнить().Выгрузить();
	Объект.Список.Загрузить(Выгрузка);
	ОбновитьФильтр();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФильтр()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧ.Сотрудник КАК Сотрудник
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&ТЧ КАК ТЧ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВТ.Сотрудник.Офис КАК Офис
	             |ИЗ
	             |	ВТ КАК ВТ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Офис
	             |АВТОУПОРЯДОЧИВАНИЕ";
	Запр.УстановитьПараметр("ТЧ", Объект.Список.Выгрузить());
	Выгрузка = Запр.Выполнить().Выгрузить();
	Этаформа.ФильтрОфис.ЗагрузитьЗначения(Выгрузка.ВыгрузитьКолонку(0));
	Этаформа.ФильтрОфис.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда) 
	
	Если Объект.Список.Количество() = 0 Тогда
		ЗаполнитьНаСервере();
		Модифицированность = Истина;
	Иначе	
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Табличная часть будет перезаполнена. Продолжить?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаполнитьНаСервере();
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;  
	
	ФильтрОфисПометкаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОкладыНаСервере()
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Ссылка", Объект.Список.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Сотрудник,
	               |	Сотрудники.Оклад КАК Оклад,
	               |	Сотрудники.Валюта КАК Валюта
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Ссылка В(&Ссылка)";
    Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайдСтроки = Объект.Список.НайтиСтроки(Новый Структура("Сотрудник", Выборка.Сотрудник)); 
		Если НайдСтроки.ВГраница() = -1 Тогда
			Продолжить;
		КонецЕсли;
		НайдСтрока = НайдСтроки[0];
	    Если Выборка.Валюта = ВалютаРубль Тогда
			НайдСтрока.ОкладВРублях = Выборка.Оклад;
		ИначеЕсли Выборка.Валюта = ВалютаДоллар Тогда
			НайдСтрока.ОкладВДолларах = Выборка.Оклад;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОклады(Команда)
	
	ЗаполнитьОкладыНаСервере(); 
	Для каждого СтрокаТЧ Из Объект.Список Цикл
		ПересчитатьСтрокуТЧ(СтрокаТЧ)
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПересчитатьСтрокуТЧ(СтрокаТЧ)

	СтрокаТЧ.НачисленоВДолларах 	= СтрокаТЧ.ОкладВДолларах + СтрокаТЧ.ПремияВДолларах;
	СтрокаТЧ.КВыдачеВДолларах 		= СтрокаТЧ.НачисленоВДолларах - СтрокаТЧ.АвансВДолларах - СтрокаТЧ.ШтрафВДолларах;
	СтрокаТЧ.НачисленоВРублях 		= СтрокаТЧ.ОкладВРублях + СтрокаТЧ.ПремияВРублях;
	СтрокаТЧ.КВыдачеВРублях 		= СтрокаТЧ.НачисленоВРублях - СтрокаТЧ.АвансВРублях - СтрокаТЧ.ШтрафВРублях;

КонецПроцедуры


&НаКлиенте
Процедура СформироватьСписокВыбораМесяца(Год)
    
	Элементы.Месяц.СписокВыбора.Очистить();
	Элементы.Месяц.СписокВыбора.Добавить(Формат(Год-1, "ЧГ=0"));
	Для к = 1 По 12  Цикл
		СформДата = Дата(Год, к, 1);
		Наим = Формат(СформДата, "ДФ = ММММ_гггг");
		Наим = СтрЗаменить(Наим, "_", " ");
		Элементы.Месяц.СписокВыбора.Добавить(Наим);    
	КонецЦикла; 
	Элементы.Месяц.СписокВыбора.Добавить(Формат(Год+1, "ЧГ=0"));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКВыдаче()
	
	Для каждого Стр ИЗ Объект.Список Цикл
		Стр.КВыдачеВДолларах = 0;
		Стр.КВыдачеВРублях = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОфисПометкаПриИзменении(Элемент)
	
	Фильтр = Новый СписокЗначений;
	Для каждого Эл Из ФильтрОфис Цикл
		Если Эл.Пометка Тогда
			Фильтр.Добавить(Эл.Значение);
		КонецЕсли;
	КонецЦикла;
	
    Для каждого СтрокаТЧ Из Объект.Список Цикл
		СтрокаТЧ.ПризнакОтбора = Фильтр.НайтиПоЗначению(СтрокаТЧ.ОФис) <> Неопределено;
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПризнакОтбора", Истина);
	Элементы.Список.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()

	Для каждого Элемент Из Элементы Цикл 
		Тип = ТипЗнч(Элемент);
		Если Тип = Тип("ПолеФормы") ИЛИ Тип = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Объект.Окончательно; 
		ИначеЕсли Тип = Тип("КнопкаФормы") И Элемент.Родитель <> Элементы.ФормаКоманднаяПанель Тогда
			Элемент.Доступность = НЕ Объект.Окончательно;
		КонецЕсли;
	КонецЦикла;	    
	Если Элементы.Найти("Снять") <> Неопределено Тогда
		Элементы.Снять.Доступность = Объект.Окончательно;
	КонецЕсли;
	Если Элементы.Найти("Установить") <> Неопределено Тогда
		Элементы.Установить.Доступность = НЕ Объект.Окончательно;
	КонецЕсли;
	Элементы.Окончательно.ТолькоПросмотр = Истина;
	
КонецПроцедуры
